#### Terraform Initialization ⚙️`success`
#### Terraform Apply 📖`success`

<details><summary>Show Apply</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # aws_dynamodb_table.idol_table[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_dynamodb_table" "idol_table" {
      [32m+[0m [0m[1m[0marn[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0mbilling_mode[0m[0m     = "PAY_PER_REQUEST"
      [32m+[0m [0m[1m[0mhash_key[0m[0m         = "IdolType"
      [32m+[0m [0m[1m[0mid[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mname[0m[0m             = "idolGroupList"
      [32m+[0m [0m[1m[0mrange_key[0m[0m        = "IdolName"
      [32m+[0m [0m[1m[0mread_capacity[0m[0m    = (known after apply)
      [32m+[0m [0m[1m[0mstream_arn[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mstream_label[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mstream_view_type[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0mtags_all[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0mwrite_capacity[0m[0m   = (known after apply)

      [32m+[0m [0mattribute {
          [32m+[0m [0m[1m[0mname[0m[0m = "IdolName"
          [32m+[0m [0m[1m[0mtype[0m[0m = "S"
        }
      [32m+[0m [0mattribute {
          [32m+[0m [0m[1m[0mname[0m[0m = "IdolType"
          [32m+[0m [0m[1m[0mtype[0m[0m = "S"
        }
      [32m+[0m [0mattribute {
          [32m+[0m [0m[1m[0mname[0m[0m = "UserDefinedIdolCategory"
          [32m+[0m [0m[1m[0mtype[0m[0m = "S"
        }

      [32m+[0m [0mglobal_secondary_index {
          [32m+[0m [0m[1m[0mhash_key[0m[0m           = "IdolName"
          [32m+[0m [0m[1m[0mname[0m[0m               = "getByIdolName"
          [32m+[0m [0m[1m[0mnon_key_attributes[0m[0m = [
              [32m+[0m [0m"getByUserDefinedCategory",
              [32m+[0m [0m"spotifyApiUrl",
              [32m+[0m [0m"spotifyClientUrl",
              [32m+[0m [0m"spotifyId",
            ]
          [32m+[0m [0m[1m[0mprojection_type[0m[0m    = "INCLUDE"
        }
      [32m+[0m [0mglobal_secondary_index {
          [32m+[0m [0m[1m[0mhash_key[0m[0m           = "UserDefinedIdolCategory"
          [32m+[0m [0m[1m[0mname[0m[0m               = "getByUserDefinedCategory"
          [32m+[0m [0m[1m[0mnon_key_attributes[0m[0m = [
              [32m+[0m [0m"IdolName",
              [32m+[0m [0m"spotifyApiUrl",
              [32m+[0m [0m"spotifyClientUrl",
              [32m+[0m [0m"spotifyId",
            ]
          [32m+[0m [0m[1m[0mprojection_type[0m[0m    = "INCLUDE"
        }

      [32m+[0m [0mpoint_in_time_recovery {
          [32m+[0m [0m[1m[0menabled[0m[0m = (known after apply)
        }

      [32m+[0m [0mserver_side_encryption {
          [32m+[0m [0m[1m[0menabled[0m[0m     = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_arn[0m[0m = (known after apply)
        }

      [32m+[0m [0mttl {
          [32m+[0m [0m[1m[0mattribute_name[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0menabled[0m[0m        = (known after apply)
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[0m[1maws_dynamodb_table.idol_table: Creating...[0m[0m
[0m[1maws_dynamodb_table.idol_table: Still creating... [10s elapsed][0m[0m
[0m[1maws_dynamodb_table.idol_table: Still creating... [20s elapsed][0m[0m
[0m[1maws_dynamodb_table.idol_table: Creation complete after 25s [id=idolGroupList][0m
[0m[1m[32m
Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
[0m```

</details>

*Pusher: @irofessional, Action: `pull_request`, Workflow: `Terraform Apply`*